package com.project.manager.helpers;

import android.content.Context;
import android.view.LayoutInflater;
import android.view.View;

import com.google.android.material.dialog.MaterialAlertDialogBuilder;
import com.google.android.material.textview.MaterialTextView;
import com.project.manager.R;

import io.noties.markwon.Markwon;

public class UpdateLogHelper {
    private static final String update_log_md = "# v1.5.2  \n" +
            "**修改内容**  \n" +
            "- 将透明背景的按钮的涟漪边缘设置为圆角形  \n" +
            "- 将标签管理界面的分组标题文本的涟漪范围调整至完全横向填充，并将右侧展开/折叠按钮涟漪边缘改为圆形  \n\n" +
            "# v1.5.1  \n" +
            "**BUG修复**  \n" +
            "- 修复主页显示的每日收入和支出可能会出现超长小数的BUG  \n" +
            "- 修复底部导航栏高亮颜色不够明显的BUG  \n" +
            "- 修复添加和修改通知解析规则时通知内容输入框失去焦点时总会提示存在语法错误的BUG  \n\n" +
            "**修改内容**  \n" +
            "- 导入数据时选择的zip文件不能超过50MB  \n\n" +
            "# v1.5.0  \n" +
            "**新增内容**  \n" +
            "- 流水记录界面添加标签过滤器  \n" +
            "- 新增主页界面，并将流水记录管理的部分组件移动至该界面  \n\n" +
            "**修改内容**  \n" +
            "- 通知解析规则输入界面会检测输入的通知内容正则表达式的语法  \n" +
            "- 如果通知解析规则的正则表达式有语法错误，会显示相应的吐司提示  \n" +
            "- 修改数据导入和导出逻辑，合并流水记录和通知解析规则的数据导入导出选项  \n" +
            "- 当同时导入流水记录和通知解析规则时才覆写通知解析规则的标签属性  \n" +
            "- 优化了标签选择弹窗的布局初始化逻辑以减少卡顿  \n" +
            "- 调整数据输入界面的按钮样式  \n\n" +
            "# v1.4.5  \n" +
            "**BUG修复**  \n" +
            "- 去除标签编辑和添加界面的标签分组名称输入框的焦点检测  \n" +
            "- 标签编辑界面不再会检测是否已有同名标签，避免仅移动分组的时候提示“已有同名标签”  \n" +
            "- 修复编辑标签时将其移动到新分组会导致标签被“隐藏”的BUG  \n\n" +
            "**修改内容**  \n" +
            "- 修改报表界面的浮点数精度补偿方法，使收支来源的百分比之和等于100的同时严格按照从大到小的顺序排列  \n" +
            "- 修改标签分组名称成功后会弹出相应的提示  \n\n" +
            "# v1.4.4  \n" +
            "**BUG修复**  \n" +
            "- 修复新增或删除流水记录后点击某条记录会导致读取的数据错位的BUG  \n" +
            "- 修复修改分组名称时总是弹出“已有同名分组”提示的BUG  \n\n" +
            "# v1.4.3  \n" +
            "**新增内容**  \n" +
            "- 添加通知解析规则导入导出、和重置的功能  \n\n" +
            "**BUG修复**  \n" +
            "- 更正默认规则中微信支付通知内容的正则表达式(旧规则不影响使用)  \n" +
            "- 修复修改或删除通知解析规则时改变的永远是第一个规则的BUG  \n\n" +
            "# v1.4.2  \n" +
            "**修改内容**  \n" +
            "- 取消上个版本将包名选择窗口调整为全屏的更改  \n" +
            "- 在包名选择窗口返回时会先关闭搜索界面再返回上一级界面  \n" +
            "- 包名选择界面可以选择是否显示系统应用  \n\n" +
            "# v1.4.1  \n" +
            "**修改内容**  \n" +
            "- 优化更新日志对话框的显示效果，删除不必要的标题下划线  \n" +
            "- 包名选择窗口显示为全屏以获得更好的动画体验  \n\n" +
            "# v1.4.0  \n" +
            "**新增内容**  \n" +
            "- 流水账界面添加显示记账天数和流水记录数量的文本  \n" +
            "- 新增使用正则表达式解析应用通知的自动记账功能  \n" +
            "- 设置界面新增后台设置选项  \n\n" +
            "**修改内容**  \n" +
            "- 添加标签和修改标签时如果分组名称留空则将该标签归为默认分组  \n" +
            "- 反转标签管理界面的展开折叠按钮箭头方向  \n\n" +
            "**BUG修复**  \n" +
            "- 修复当某个分组没有标签时无法在标签编辑界面显示的BUG  \n" +
            "- 修复报表界面每月收支与收支来源百分比总和可能不为100的BUG  \n" +
            "- 修复新建流水界面直接点击TabLayout到收入界面后第一次点击金额输入框无法正常输入的BUG  \n" +
            "- 修复早晨七点半之前报表界面的日期选择对话框默认选择昨天的BUG  \n" +
            "- 修复清空数据无法清空记账天数的BUG  \n\n" +
            "# v1.3.2  \n" +
            "**修改内容**  \n" +
            "- 每月结余所占比例由除以年结余改为除以月结余绝对值总和  \n" +
            "- 限制金额输入不能以0开头  \n" +
            "- 为一些文本输入框添加清空内容的按钮  \n\n" +
            "**BUG修复**  \n" +
            "- 修复显示每月结余时可能出现负数百分比的BUG  \n" +
            "- 修复显示每月结余可能导致结余为0的月份显示1%比例的BUG  \n\n" +
            "# v1.3.1  \n" +
            "**BUG修复**  \n" +
            "- 修复标签过多时标签选择菜单不能正常滚动到底部的BUG  \n" +
            "- 修复修改标签时必须修改标签名才能保存的BUG  \n\n" +
            "# v1.3.0  \n" +
            "**新增内容**  \n" +
            "- 报表界面添加今年每月流水数据视图（当查看这一年的报表时）  \n\n" +
            "**修改内容**  \n" +
            "- 删除流水记录时会弹出确认操作的对话框  \n" +
            "- 补充报表界面可点击的视图点击时的波纹效果  \n\n" +
            "# v1.2.0  \n" +
            "**新增内容**  \n" +
            "- 设置界面添加更新日志查看功能  \n" +
            "- 添加标签和标签分组合并功能  \n" +
            "- 标签修改和新增标签界面添加有关分组名称输入的提示  \n\n" +
            "**修改内容**  \n" +
            "- 调整标签选择弹窗内容的边距，提升曲面屏设备的观感  \n" +
            "- 标签编辑页面的标签文本视图添加点击时的波纹效果  \n" +
            "- 为透明背景的按钮添加点击时的波纹效果  \n" +
            "- 报表界面的收支来源改为根据金额降序排序  \n" +
            "- 如果输入流水数据时未输入备注则会使用默认备注  \n" +
            "- 添加标签名称和分组名称不能同名的输入限制  \n\n" +
            "**BUG修复**  \n" +
            "- 修复记录两位小数的金额时可能导致报表界面出现精度问题的BUG  \n\n" +
            "# v1.1.2  \n" +
            "**BUG修复**  \n" +
            "- 修复标签较多时标签编辑页面无法正常滚动的BUG  \n\n" +
            "# v1.1.1  \n" +
            "**BUG修复**  \n" +
            "- 修复报表界面无法滚动至底部的BUG  \n\n" +
            "# v1.1.0  \n" +
            "**BUG修复**  \n" +
            "- 修复编辑流水数据时删除该流水记录的标签对应的分组后不重启APP并重新导入删除前的流水数据，会导致标签文本框无法自动填充标签名称的BUG  \n" +
            "- 修复删除流水数据输入界面中输入的标签后流水数据输入界面无法清空标签的BUG  \n\n" +
            "**新增内容**  \n" +
            "- 报表界面添加收支来源数据  \n" +
            "- 为一些界面添加标题栏的返回按钮（主界面除外）  \n\n" +
            "**更改内容**  \n" +
            "- 报表界面的日期选择对话框会记住上一次选择的日期  \n" +
            "- 更改报表界面的日期选择逻辑  \n" +
            "- 更改关于软件弹窗的内容  \n\n" +
            "# v1.0.0  \n" +
            "第一个版本发布";

    public static void showUpdateLogDialog(Context context) {
        View update_dialog_view = LayoutInflater.from(context)
                .inflate(R.layout.view_md_text, null);
        MaterialTextView text_view = update_dialog_view.findViewById(R.id.md_textview_in_dialog);

        //使用Markown渲染Markdown文本
        Markwon markwon = Markwon.create(context);
        markwon.setMarkdown(text_view, update_log_md);

        new MaterialAlertDialogBuilder(context)
                .setTitle(R.string.update_log)
                .setView(update_dialog_view)
                .setPositiveButton("关闭", ((dialog, which) -> dialog.dismiss()))
                .show();
    }
}
